dovanviet04112004/esp32s3-face-attendance/firmware/components/net_provision/test_apps/register/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_UNITY_ENABLE_IDF_TEST_RUNNER=y
CONFIG_COMPILER_STACK_CHECK_MODE_STRONG=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.dev.csv"
# The kiosk runs this on ota_task's 8 KB; a TLS handshake overruns the 3.5 KB default.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
